Autodesk.Revit.DB.Fabrication.FabricationUtils.OpenFabricationJob(Autodesk.Revit.DB.Document,System.String,System.Boolean)
Opens fabrication job and adds valid parts found into the current project.
pADoc:
Document to add parts to.
filename:
Full filename of fabrication job to open.
validate:
If true validates all new part connections and disconnects improper ones, with warnings.
Returns:
Returns element ids of new elements that are added.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The model must not have any fabrication parts.
-or-
Fabrication configuration is missing.
-or-
Fabrication job did not exist at filename.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Fabrication.FabricationUtils.ExportToPCF(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.String)
Exports a list of fabrication parts into PCF format.
document:
The document.
ids:
An array of FabricationPart element identifiers. Non-fabrication parts are ignored.
filename:
The name given to the output file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication configuration is missing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Fabrication.FabricationUtils.ExportToMAJ(Autodesk.Revit.DB.Document,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId},System.String,System.Boolean,System.Collections.Generic.IList{Autodesk.Revit.DB.ElementId}@)
Exports a list of fabrication parts into the native fabrication job (MAJ) format.
document:
The document.
ids:
An array of FabricationPart element identifiers. Non-fabrication parts are ignored.
filename:
The name given to the output file.
addHolesForTaps:
Set true to have holes for taps on straights added to the created fabrication job.
idsNotExported:
An array of element identifiers that were not included in the export.
Returns:
Returns the number of fabrication parts created in the export. Returns zero if no valid fabrication parts or unable to create the file.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication configuration is missing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018.1

Autodesk.Revit.DB.Fabrication.FabricationUtils.ValidateConnectivity(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.Connector,Autodesk.Revit.DB.Connector)
Check if two connectors are valid to connect directly without couplings
document:
The document.
connector1:
First connector to check.
connector2:
Second connector to check against.
Returns:
True if connection is valid, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Fabrication.FabricationUtils
General utility methods in the Autodesk Revit MEP product for fabrication.
Since:
2016